ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_efuse.h
#define EFUSE_SEQ_PROGRAM_CTL_0_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_0: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_0_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_0: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_0_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_0: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_0_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_0: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_0_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_0: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_0_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_0: DONE (Bitfield-Mask: 0x01)       */
/* ================================================  EFUSE.SEQ_PROGRAM_CTL_1  ================================================ */
#define EFUSE_SEQ_PROGRAM_CTL_1_CYCLES_Pos (0UL)                /*!< EFUSE SEQ_PROGRAM_CTL_1: CYCLES (Bit 0)                   */
#define EFUSE_SEQ_PROGRAM_CTL_1_CYCLES_Msk (0x3ffUL)            /*!< EFUSE SEQ_PROGRAM_CTL_1: CYCLES (Bitfield-Mask: 0x3ff)    */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_A_Pos (16UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_A (Bit 16)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_A_Msk (0x10000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_A (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_B_Pos (17UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_B (Bit 17)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_B_Msk (0x20000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_B (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_C_Pos (18UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_C (Bit 18)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_C_Msk (0x40000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_C (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_D_Pos (19UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_D (Bit 19)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_D_Msk (0x80000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_D (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_E_Pos (20UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_E (Bit 20)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_E_Msk (0x100000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_E (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_1_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_1: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_1_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_1: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_1_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_1: DONE (Bitfield-Mask: 0x01)       */
/* ================================================  EFUSE.SEQ_PROGRAM_CTL_2  ================================================ */
#define EFUSE_SEQ_PROGRAM_CTL_2_CYCLES_Pos (0UL)                /*!< EFUSE SEQ_PROGRAM_CTL_2: CYCLES (Bit 0)                   */
#define EFUSE_SEQ_PROGRAM_CTL_2_CYCLES_Msk (0x3ffUL)            /*!< EFUSE SEQ_PROGRAM_CTL_2: CYCLES (Bitfield-Mask: 0x3ff)    */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_A_Pos (16UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_A (Bit 16)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_A_Msk (0x10000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_A (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_B_Pos (17UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_B (Bit 17)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_B_Msk (0x20000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_B (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_C_Pos (18UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_C (Bit 18)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_C_Msk (0x40000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_C (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_D_Pos (19UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_D (Bit 19)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_D_Msk (0x80000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_D (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_E_Pos (20UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_E (Bit 20)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_E_Msk (0x100000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_E (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_2_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_2: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_2_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_2: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_2_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_2: DONE (Bitfield-Mask: 0x01)       */
/* ================================================  EFUSE.SEQ_PROGRAM_CTL_3  ================================================ */
#define EFUSE_SEQ_PROGRAM_CTL_3_CYCLES_Pos (0UL)                /*!< EFUSE SEQ_PROGRAM_CTL_3: CYCLES (Bit 0)                   */
#define EFUSE_SEQ_PROGRAM_CTL_3_CYCLES_Msk (0x3ffUL)            /*!< EFUSE SEQ_PROGRAM_CTL_3: CYCLES (Bitfield-Mask: 0x3ff)    */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_A_Pos (16UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_A (Bit 16)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_A_Msk (0x10000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_A (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_B_Pos (17UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_B (Bit 17)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_B_Msk (0x20000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_B (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_C_Pos (18UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_C (Bit 18)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_C_Msk (0x40000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_C (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_D_Pos (19UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_D (Bit 19)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_D_Msk (0x80000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_D (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_E_Pos (20UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_E (Bit 20)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_E_Msk (0x100000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_E (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_3_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_3: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_3_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_3: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_3_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_3: DONE (Bitfield-Mask: 0x01)       */
/* ================================================  EFUSE.SEQ_PROGRAM_CTL_4  ================================================ */
#define EFUSE_SEQ_PROGRAM_CTL_4_CYCLES_Pos (0UL)                /*!< EFUSE SEQ_PROGRAM_CTL_4: CYCLES (Bit 0)                   */
#define EFUSE_SEQ_PROGRAM_CTL_4_CYCLES_Msk (0x3ffUL)            /*!< EFUSE SEQ_PROGRAM_CTL_4: CYCLES (Bitfield-Mask: 0x3ff)    */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_A_Pos (16UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_A (Bit 16)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_A_Msk (0x10000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_A (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_B_Pos (17UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_B (Bit 17)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_B_Msk (0x20000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_B (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_C_Pos (18UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_C (Bit 18)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_C_Msk (0x40000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_C (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_D_Pos (19UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_D (Bit 19)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_D_Msk (0x80000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_D (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_E_Pos (20UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_E (Bit 20)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_E_Msk (0x100000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_E (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_4_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_4: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_4_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_4: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_4_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_4: DONE (Bitfield-Mask: 0x01)       */
/* ================================================  EFUSE.SEQ_PROGRAM_CTL_5  ================================================ */
#define EFUSE_SEQ_PROGRAM_CTL_5_CYCLES_Pos (0UL)                /*!< EFUSE SEQ_PROGRAM_CTL_5: CYCLES (Bit 0)                   */
#define EFUSE_SEQ_PROGRAM_CTL_5_CYCLES_Msk (0x3ffUL)            /*!< EFUSE SEQ_PROGRAM_CTL_5: CYCLES (Bitfield-Mask: 0x3ff)    */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_A_Pos (16UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_A (Bit 16)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_A_Msk (0x10000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_A (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_B_Pos (17UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_B (Bit 17)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_B_Msk (0x20000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_B (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_C_Pos (18UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_C (Bit 18)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_C_Msk (0x40000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_C (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_D_Pos (19UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_D (Bit 19)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_D_Msk (0x80000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_D (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_E_Pos (20UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_E (Bit 20)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_E_Msk (0x100000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_E (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_F_Pos (21UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_F (Bit 21)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_F_Msk (0x200000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_F (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_G_Pos (22UL)             /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_G (Bit 22)                */
#define EFUSE_SEQ_PROGRAM_CTL_5_STROBE_G_Msk (0x400000UL)       /*!< EFUSE SEQ_PROGRAM_CTL_5: STROBE_G (Bitfield-Mask: 0x01)   */
#define EFUSE_SEQ_PROGRAM_CTL_5_DONE_Pos  (31UL)                /*!< EFUSE SEQ_PROGRAM_CTL_5: DONE (Bit 31)                    */
#define EFUSE_SEQ_PROGRAM_CTL_5_DONE_Msk  (0x80000000UL)        /*!< EFUSE SEQ_PROGRAM_CTL_5: DONE (Bitfield-Mask: 0x01)       */


#endif /* _CYIP_EFUSE_H_ */


/* [] END OF FILE */
